<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"18a4e8eb17a34f37a2c0e3f9c3e57088a02277534c07b7372e05478b2a11bee2","plan_job_ref":"Job Terraform Plan #117 at https://github.com/cal-itp/data-infra/actions/runs/14499771022","plan_out_hash":"61522fee21349d5f912458db13aa1603f347a806768a0f2e90e049bbfe325fcf","plan_hash":"8e9f145651b1b3b252f9b869bf55b7d1583f308cc81e9270d4ebfc15fc614759","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra/iam/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_custom_role.calitp-dds-analyst will be created
+   resource "google_project_iam_custom_role" "calitp-dds-analyst" {
+       deleted     = (known after apply)
+       description = "Custom role for DDS Analysts"
+       id          = (known after apply)
+       name        = (known after apply)
+       permissions = [
+           "viewer",
        ]
+       project     = "cal-itp-data-infra"
+       role_id     = "***********"
+       stage       = "GA"
+       title       = "DDS Analyst"
    }

  # google_project_iam_member.DOT_DDS_Data_Pipeline_and_Warehouse_Users will be created
+   resource "google_project_iam_member" "DOT_DDS_Data_Pipeline_and_Warehouse_Users" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "principalSet://iam.googleapis.com/locations/global/workforcePools/dot-ca-gov/group/DOT_DDS_Data_Pipeline_and_Warehouse_Users"
+       project = "cal-itp-data-infra"
+       role    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #117](https://github.com/cal-itp/data-infra/actions/runs/14499771022)